Repository: richiefi/richie-news-wordpress-plugin
Catalog: richie/languages/richie-*.po
Languages: fi

source: "product" attribute is required
fi: "product" parametri on vaadittu

source: 1 year
fi: 1 vuosi

source: Access token
fi: Pääsyavain

source: Ad data
fi: Mainostiedot

source: Ad provider
fi: Mainospalvelu

source: Ad slots
fi: Mainospaikat

source: Add ad slot
fi: Lisää mainospaikka

source: Add new ad slot
fi: Lisää uusi mainospaikka

source: Add New Article set
fi: Luo uusi artikkelikokoelma

source: Add new feed source
fi: Lisää uusi uutislähde

source: Add source
fi: Lisää uutislähde

source: All Article sets
fi: Kaikki artikkelikokoelmat

source: All time
fi: Kaikki

source: Allow duplicate articles in this source
fi: Salli duplikaattiartikkelit tässä lähteessä

source: Allow duplicates
fi: Salli duplikaatit

source: Article set
fi: Artikkelikokoelma

source: ASC
fi: Nouseva järjestys

source: Asset feed
fi: Asset-syöte

source: Assets
fi: Assetit

source: Basic data
fi: Perustiedot

source: Categories
fi: Kategoriat

# column name
source: Actions
fi: Toiminnot

# column name
source: Ad data
fi: Tiedot

# column name
source: Ad provider
fi: Palvelu

# column name
source: Allow duplicates
fi: Salli duplikaatit

# column name
source: Article Set
fi: Artikkelikokoelma

# column name
source: Categories
fi: Kategoriat

# column name
source: Disable summary
fi: Piilota yhteenveto

# column name
source: Index
fi: Järjestysnumero

# column name
source: List layout
fi: Muoto

# column name
source: Max age
fi: Artikkelin ikä

# column name
source: Name
fi: Nimi

# column name
source: Order
fi: Järjestys

# column name
source: Posts
fi: Lukumäärä

source: Copy to form
fi: Kopioi lomakkeelle

source: Current front page id is
fi: Nykyinen etusivun artikkeli-id on

source: day
fi: päivä

source: DESC
fi: Laskeva järjestys

source: Disable article summary
fi: Piilota artikkelin yhteenveto

source: Do not show summary text in news list
fi: Älä näytä artikkelin yhteenvetoa uutislistauksessa

source: Edit Article set
fi: Muokkaa artikkelikokoelmaa

source: Edit Article sets
fi: Muokkaa artikkelikokoelmia

source: Failed to fetch issues
fi: Näköislehtien lataus epäonnistui

source: Failed to get content
fi: Sisällön lataus epäonnistui

source: Failed to parse json, unable to save: %s
fi: JSON-tiedon käsittely epäonnistui, tallennus ei onnistu: %s

source: Failed to save adslot, validation failed: %s
fi: Mainospaikan tallennus epäonnistui: %s

source: Fetch posts from herald modules of this page id. Rest of filters will be ignored.
fi: Käytä artikkeleita annetun sivun herald-teeman moduuleista. Loput suodattimista jätetään huomioimatta.

source: Filters
fi: Suodattimet

source: General settings
fi: Yleiset asetukset

source: Header to display before the story, useful on the first small_group_item of a group
fi: Otsikko, joka näytetään ennen artikkelia. Hyödyllinen käytettäessä small_group_item muotoa.

source: Herald featured module
fi: Herald-teeman nostot

source: Herald module name given but post id was empty
fi: Herald-teeman moduuliotsikko annettu, mutta artikkeli id on tyhjä.

source: Herald module title
fi: Herald moduulin otsikko

source: Herald page ID
fi: Herald sivu ID

source: Include posts that are not older than specific time range
fi: Ota mukaan artikkelit, jotka eivät ole määriteltyä arvoa vanhempia.

source: Invalid configuration, missing hostname in settings
fi: Virheelliset asetukset, verkko-osoite puuttuu

source: Invalid issue uuid
fi: Virheellinen lehden tunniste

source: Invalid organization
fi: Virheellinen organisaatio

source: Invalid timestamp, it must be an integer
fi: Virheellinen aikaleima, pitää olla kokonaisluku

source: Last publish time:
fi: Viimeksi julkaistu:

source: List group title
fi: Ryhmän otsikko

source: List layout
fi: Listauksen muoto

source: Maggio hostname
fi: Maggio verkko-osoite

source: Maggio index cache updated.
fi: Maggio indeksin välimuisti päivitetty.

source: Maggio index range
fi: Maggio indeksi

source: Maggio organization
fi: Maggio organisaatio

source: Maggio secret
fi: Maggio salausavain

source: Maggio settings
fi: Maggio-asetukset

source: Member only level
fi: Ainoastaan tilaajille -taso

source: Metered level
fi: Mittaroitu taso

source: Missing secret
fi: Puuttuva salausavain

source: Module title from the given page to be used as a source. If empty, defaults to first featured type module.
fi: Lähteenä käytetään moduulia, jolla on annettu otsikko. Jos tyhjä, lähteenä käytetään ensimmäistä 'featured'-tyyppistä moduulia.

source: month
fi: kuukausi

source: Name
fi: Nimi

source: Name and number of posts are required
fi: Nimi ja artikkelien lukumäärä ovat vaadittuja

source: New Article set Name
fi: Uusi artikkelikokoelman nimi

source: News assets
fi: Uutis-assetit

source: News sources
fi: Uutislähteet

source: News sources have unpublished changes.
fi: Uutislähteissä on julkaisemattomia muutoksia.

source: No data found
fi: Tiedot puuttuvat

source: No issues found
fi: Lehtiä ei löytynyt

source: No slots configured. Add ad slots with the form below.
fi: Ei luotuja mainospaikkoja. Lisää mainospaikka alapuolen lomakkeella.

source: No sources configured. Add news feed sources with the form below.
fi: Ei luotuja uutislähteitä. Lisää uusi lähde alapuolen lomakkeella.

source: Not used
fi: Ei käytössä

source: Number of posts
fi: Artikkelien lukumäärä

source: Number of posts included in the feed
fi: Syötteeseen mukaanotettavien artikkelien määrä

source: Options
fi: Lisävalinnat

source: Order by
fi: Järjestä

source: Order direction
fi: Järjestyksen suunta

source: Paywall
fi: Maksumuuri

source: Popular posts (24 hours)
fi: Suosituimmat (24 tuntia)

source: Popular posts (month)
fi: Suosituimmat (kuukausi)

source: Popular posts (week)
fi: Suosituimmat (viikko)

source: Post author
fi: Artikkelin tekijä

source: Post date
fi: Artikkelin päiväys

source: Post ID
fi: Artikkelin ID

source: Post max age
fi: Artikkelin ikä korkeintaan

source: Post modified time
fi: Artikkelin muokkausaika

source: Post title
fi: Artikkelin otsikko

source: Post views
fi: Artikkelinäytöt

source: Publish
fi: Julkaise

source: Publish now
fi: Julkaise nyt

source: Remove
fi: Poista

source: Required membership level
fi: Vaadittu käyttäjätaso

source: Revert changes
fi: Peruuta muutokset

source: Save all changes
fi: Tallenna muutokset

source: Search Article sets
fi: Etsi artikkelikokoelmaa

source: Settings
fi: Asetukset

source: Slot position
fi: Mainospaikan järjestysnumero

source: Specify an index number for the ad slot placement in the article set feed. 1-based index, so 1 means the first item on the feed. Existing index for the article set is overwritten.
fi: Syötä haluttu järjestysnumero mainospaikalle artikkelisyötteessä. 1-pohjainen indeksi, joten 1 sijoittaa mainoksen ensimmäiseksi syötteessä. Olemassa oleva järjestysnumero artikkelikokoelmassa korvataan tallennuksen yhteydessä.

# taxonomy general name
source: Article sets
fi: Artikkelikokoelmat

# taxonomy singular name
source: Article set
fi: Artikkelikokoelma

source: Update Article set
fi: Päivitä artikkelikokoelma

source: week
fi: viikko

source: You need to be logged in and have an active subscription to access these issues
fi: Sinun tulee olla kirjautuneena ja sinulla pitää olla aktiivinen tilaus lukeaksesi näitä lehtiä.
